src/ai-operator/InformationRegisters/ИИО_ДанныеОтката.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИИО_ДанныеОтката</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеДо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияДанныхПосле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткаченоПакетом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ai-operator/CommonModules/ИИО_Журнал/Ext/Module.bsl
// Журнал операций ИИ-оператора: события журнала регистрации и данные отката.
// Единственный модуль, который пишет в регистр ИИО_ДанныеОтката и читает журнал регистрации.
// Для этого ему нужен привилегированный режим; бизнес-объекты здесь не меняются.

#Область СлужебныйПрограммныйИнтерфейс

// Записывает событие ИИ-оператора в журнал регистрации: имя с префиксом «ИИОператор.», сведения - JSON в комментарии.
//
// Параметры:
//  Событие - Строка - Имя события без префикса, например Действие.Объект.
//  Уровень - УровеньЖурналаРегистрации
//  Сведения - Структура - Сведения события: строки, числа, булевы значения, массивы и структуры из них.
//  Объект - ЛюбаяСсылка, Неопределено - Объект события: по нему событие находится отбором журнала
//    и командой «Журнал регистрации» из формы объекта.
Процедура ЗаписатьСобытие(Событие, Уровень, Сведения, Объект = Неопределено) Экспорт

	ИмяСобытия = ПрефиксСобытий() + "." + Событие;
	Комментарий = ИИО_ОтветКлиентСервер.ВJSON(Сведения);
	Если Объект = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, , , Комментарий);
	Иначе
		ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, Объект.Метаданные(), Объект, Комментарий);
	КонецЕсли;

КонецПроцедуры

// Пишет ли журнал регистрации события уровня «Информация». Без этого действия запрещены:
// изменения прошли бы без следа.
//
// Возвращаемое значение:
//  Булево
Функция ЖурналДействийВключен() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Уровни = ПолучитьИспользованиеЖурналаРегистрации();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Уровни.Найти(УровеньЖурналаРегистрации.Информация) <> Неопределено;

КонецФункции

// Записывает состояние объекта до изменения. Вызывается внутри транзакции изменения объекта,
// поэтому запись фиксируется или отменяется вместе с изменением.
//
// Параметры:
//  Пакет - Строка - batch_id.
//  Объект - ДокументСсылка, СправочникСсылка
//  Действие - Строка - Код выполненного действия.
//  СостояниеДо - Структура - Состояние объекта до изменения, см. обработчик действия.
//  ВерсияДанныхПосле - Строка - ВерсияДанных объекта сразу после изменения.
Процедура ЗаписатьДанныеОтката(Пакет, Объект, Действие, СостояниеДо, ВерсияДанныхПосле) Экспорт

	Если Не ТранзакцияАктивна() Тогда
		ВызватьИсключение НСтр("ru = 'Данные отката пишутся только в транзакции изменения объекта.'");
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.ИИО_ДанныеОтката.СоздатьМенеджерЗаписи();
	Запись.Пакет = Пакет;
	Запись.Объект = Объект;
	Запись.Действие = Действие;
	Запись.СостояниеДо = ИИО_ОтветКлиентСервер.ВJSON(СостояниеДо);
	Запись.ВерсияДанныхПосле = ВерсияДанныхПосле;
	Запись.Автор = Пользователи.АвторизованныйПользователь();
	Запись.Дата = ТекущаяДатаСеанса();
	Запись.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Отмечает изменение объекта откаченным. Вызывается внутри транзакции обратного изменения.
//
// Параметры:
//  Пакет - Строка - Пакет, изменение которого откатывается.
//  Объект - ДокументСсылка, СправочникСсылка
//  ПакетОтката - Строка - Пакет, которым выполнен откат.
Процедура ОтметитьОткат(Пакет, Объект, ПакетОтката) Экспорт

	Если Не ТранзакцияАктивна() Тогда
		ВызватьИсключение НСтр("ru = 'Откат отмечается только в транзакции обратного изменения объекта.'");
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИИО_ДанныеОтката");
	ЭлементБлокировки.УстановитьЗначение("Пакет", Пакет);
	ЭлементБлокировки.УстановитьЗначение("Объект", Объект);
	Блокировка.Заблокировать();

	Запись = РегистрыСведений.ИИО_ДанныеОтката.СоздатьМенеджерЗаписи();
	Запись.Пакет = Пакет;
	Запись.Объект = Объект;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение НСтр("ru = 'Нет данных отката объекта в пакете.'");
	ИначеЕсли ЗначениеЗаполнено(Запись.ОткаченоПакетом) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Изменение уже откачено пакетом %1.'"), Запись.ОткаченоПакетом);
	КонецЕсли;
	Запись.ОткаченоПакетом = ПакетОтката;
	Запись.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Данные отката пакета.
//
// Параметры:
//  Пакет - Строка - batch_id.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Объект - ДокументСсылка, СправочникСсылка
//   * Действие - Строка
//   * СостояниеДо - Структура
//   * ВерсияДанныхПосле - Строка
//   * ВерсияДанныхСейчас - Строка - Пустая, если объект удален.
//   * Автор - СправочникСсылка.Пользователи
//   * Дата - Дата
//   * ОткаченоПакетом - Строка
Функция ДанныеОтката(Пакет) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеОтката.Объект КАК Объект,
	|	ДанныеОтката.Действие КАК Действие,
	|	ДанныеОтката.СостояниеДо КАК СостояниеДо,
	|	ДанныеОтката.ВерсияДанныхПосле КАК ВерсияДанныхПосле,
	|	ДанныеОтката.Автор КАК Автор,
	|	ДанныеОтката.Дата КАК Дата,
	|	ДанныеОтката.ОткаченоПакетом КАК ОткаченоПакетом
	|ИЗ
	|	РегистрСведений.ИИО_ДанныеОтката КАК ДанныеОтката
	|ГДЕ
	|	ДанныеОтката.Пакет = &Пакет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Пакет", Пакет);
	Выборка = Запрос.Выполнить().Выбрать();

	Данные = Новый ТаблицаЗначений;
	Для Каждого Колонка Из СтрРазделить(
		"Объект, Действие, СостояниеДо, ВерсияДанныхПосле, ВерсияДанныхСейчас, Автор, Дата, ОткаченоПакетом",
		", ", Ложь) Цикл
		Данные.Колонки.Добавить(Колонка);
	КонецЦикла;
	Пока Выборка.Следующий() Цикл
		Строка = Данные.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.СостояниеДо = ИзJSON(Выборка.СостояниеДо);
	КонецЦикла;

	// Текущая версия читается с правами пользователя: объект, который он больше не видит, не откатывается.
	УстановитьПривилегированныйРежим(Ложь);
	Версии = ВерсииДанных(Данные.ВыгрузитьКолонку("Объект"));
	Для Каждого Строка Из Данные Цикл
		Строка.ВерсияДанныхСейчас = Версии.Получить(Строка.Объект);
	КонецЦикла;
	Возврат Данные;

КонецФункции

// Текущие версии данных объектов, доступных пользователю.
//
// Параметры:
//  Ссылки - Массив из ЛюбаяСсылка
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ЛюбаяСсылка
//   * Значение - Строка - ВерсияДанных.
Функция ВерсииДанных(Ссылки) Экспорт

	ПоВидам = Новый Соответствие;
	Для Каждого Ссылка Из Ссылки Цикл
		ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
		Если ПоВидам.Получить(ПолноеИмя) = Неопределено Тогда
			ПоВидам.Вставить(ПолноеИмя, Новый Массив);
		КонецЕсли;
		ПоВидам.Получить(ПолноеИмя).Добавить(Ссылка);
	КонецЦикла;

	Версии = Новый Соответствие;
	Для Каждого КлючИЗначение Из ПоВидам Цикл
		Запрос = Новый Запрос(СтрШаблон(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Объекты.Ссылка КАК Ссылка,
			|	Объекты.ВерсияДанных КАК ВерсияДанных
			|ИЗ
			|	%1 КАК Объекты
			|ГДЕ
			|	Объекты.Ссылка В (&Ссылки)",
			КлючИЗначение.Ключ));
		Запрос.УстановитьПараметр("Ссылки", КлючИЗначение.Значение);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Версии.Вставить(Выборка.Ссылка, Выборка.ВерсияДанных);
		КонецЦикла;
	КонецЦикла;
	Возврат Версии;

КонецФункции

// Пакеты действий за период для формы «Журнал операций»: события Действие.Начало, Действие.Завершение
// и Действие.Отмена, сгруппированные по batch_id, и признак, есть ли что откатить.
//
// Параметры:
//  Начало - Дата
//  Конец - Дата
//  ВсеПользователи - Булево - Истина - пакеты всех пользователей (только для администратора ИИ-оператора).
//
// Возвращаемое значение:
//  ТаблицаЗначений - Колонки: Пакет, Дата, ДатаЗавершения, Пользователь, Действие, ОткатПакета, Источник,
//   Объектов, Выполнено, Ошибок, Пропущено, Состояние, Неоткачено.
Функция ПакетыЗаПериод(Начало, Конец, ВсеПользователи) Экспорт

	Если ВсеПользователи И Не ИИО_Права.ЭтоАдминистраторИИОператора() Тогда
		ВсеПользователи = Ложь;
	КонецЕсли;
	События = СобытияДействий(Начало, Конец, "Действие.Начало, Действие.Завершение, Действие.Отмена", ВсеПользователи);

	Пакеты = Новый ТаблицаЗначений;
	Для Каждого Колонка Из СтрРазделить("Пакет, Дата, ДатаЗавершения, Пользователь, Действие, ОткатПакета, Источник, "
		+ "Объектов, Выполнено, Ошибок, Пропущено, Состояние, Неоткачено", ", ", Ложь) Цикл
		Пакеты.Колонки.Добавить(Колонка);
	КонецЦикла;
	Индекс = Новый Соответствие;

	Для Каждого Событие Из События Цикл
		Сведения = ИзJSON(Событие.Комментарий);
		Пакет = СвойствоСведений(Сведения, "batch_id");
		Если Не ЗначениеЗаполнено(Пакет) Тогда
			Продолжить;
		КонецЕсли;
		Строка = Индекс.Получить(Пакет);
		Если Строка = Неопределено Тогда
			Строка = Пакеты.Добавить();
			Строка.Пакет = Пакет;
			Строка.Дата = Событие.Дата;
			Строка.Пользователь = Событие.ИмяПользователя;
			Строка.Состояние = "started";
			Строка.Объектов = 0;
			Строка.Выполнено = 0;
			Строка.Ошибок = 0;
			Строка.Пропущено = 0;
			Строка.Неоткачено = 0;
			Индекс.Вставить(Пакет, Строка);
		КонецЕсли;
		ИмяСобытия = Сред(Событие.Событие, СтрДлина(ПрефиксСобытий()) + 2);
		Если ИмяСобытия = "Действие.Начало" Или ИмяСобытия = "Действие.Отмена" Тогда
			Строка.Дата = Событие.Дата;
			Строка.Действие = СвойствоСведений(Сведения, "action", "");
			Строка.ОткатПакета = СвойствоСведений(Сведения, "undo_of", "");
			Строка.Источник = СвойствоСведений(Сведения, "source", "");
			Строка.Объектов = СвойствоСведений(Сведения, "count", 0);
		КонецЕсли;
		Если ИмяСобытия = "Действие.Отмена" Тогда
			Строка.Состояние = "cancelled";
			Строка.ДатаЗавершения = Событие.Дата;
		ИначеЕсли ИмяСобытия = "Действие.Завершение" Тогда
			Строка.Состояние = "completed";
			Строка.ДатаЗавершения = Событие.Дата;
			Строка.Выполнено = СвойствоСведений(Сведения, "done", 0);
			Строка.Ошибок = СвойствоСведений(Сведения, "failed", 0);
			Строка.Пропущено = СвойствоСведений(Сведения, "skipped", 0);
		КонецЕсли;
	КонецЦикла;

	Если Пакеты.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеОтката.Пакет КАК Пакет,
		|	СУММА(ВЫБОР КОГДА ДанныеОтката.ОткаченоПакетом = """" ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Неоткачено
		|ИЗ
		|	РегистрСведений.ИИО_ДанныеОтката КАК ДанныеОтката
		|ГДЕ
		|	ДанныеОтката.Пакет В (&Пакеты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеОтката.Пакет";
		Запрос.УстановитьПараметр("Пакеты", Пакеты.ВыгрузитьКолонку("Пакет"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Строка = Индекс.Получить(Выборка.Пакет);
			Строка.Неоткачено = Выборка.Неоткачено;
			Если Выборка.Неоткачено = 0 Тогда
				Строка.Состояние = "undone";
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Пакеты.Сортировать("Дата Убыв");
	Возврат Пакеты;

КонецФункции

// Результаты по объектам пакета из событий Действие.Объект.
//
// Параметры:
//  Пакет - Строка - batch_id.
//  ДатаПакета - Дата - Дата начала пакета: события ищутся от нее в пределах суток.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Колонки: Объект, Действие, Результат, Ошибка, Дата.
Функция ОбъектыПакета(Пакет, ДатаПакета) Экспорт

	События = СобытияДействий(ДатаПакета, ДатаПакета + 86400, "Действие.Объект",
		ИИО_Права.ЭтоАдминистраторИИОператора());
	Объекты = Новый ТаблицаЗначений;
	Для Каждого Колонка Из СтрРазделить("Объект, Действие, Результат, Ошибка, Дата", ", ", Ложь) Цикл
		Объекты.Колонки.Добавить(Колонка);
	КонецЦикла;
	Для Каждого Событие Из События Цикл
		Сведения = ИзJSON(Событие.Комментарий);
		Если СвойствоСведений(Сведения, "batch_id") <> Пакет Тогда
			Продолжить;
		КонецЕсли;
		Строка = Объекты.Добавить();
		Строка.Объект = Событие.Данные;
		Строка.Действие = СвойствоСведений(Сведения, "action", "");
		Строка.Результат = СвойствоСведений(Сведения, "result", "");
		Строка.Ошибка = СвойствоСведений(Сведения, "error", "");
		Строка.Дата = Событие.Дата;
	КонецЦикла;
	Возврат Объекты;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрефиксСобытий()

	Возврат НСтр("ru = 'ИИОператор'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

// Возвращает события ИИ-оператора за период. Пользователь видит только свои события, администратор - все.
//
// Параметры:
//  Начало - Дата
//  Конец - Дата
//  ИменаСобытий - Строка - имена событий без префикса через запятую,
//    например "Действие.Начало, Действие.Завершение".
//  ВсеПользователи - Булево - Истина - события всех пользователей, Ложь - только текущего.
//
// Возвращаемое значение:
//  ТаблицаЗначений - события журнала регистрации по возрастанию даты,
//    колонки: Дата, Событие, Комментарий, ИмяПользователя, Данные.
Функция СобытияДействий(Начало, Конец, ИменаСобытий, ВсеПользователи)

	Имена = Новый Массив;
	Для Каждого Имя Из СтрРазделить(ИменаСобытий, ", ", Ложь) Цикл
		Имена.Добавить(ПрефиксСобытий() + "." + Имя);
	КонецЦикла;
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", Начало);
	Отбор.Вставить("ДатаОкончания", Конец);
	Отбор.Вставить("Событие", Имена);
	Если Не ВсеПользователи Тогда
		Отбор.Вставить("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь());
	КонецЕсли;

	// Чтение журнала регистрации требует права «Журнал регистрации», которого у пользователя нет.
	УстановитьПривилегированныйРежим(Истина);
	События = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(События, Отбор, "Дата,Событие,Комментарий,ИмяПользователя,Данные");
	УстановитьПривилегированныйРежим(Ложь);
	События.Сортировать("Дата");
	Возврат События;

КонецФункции

Функция ИзJSON(Текст)

	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Новый Структура;
	КонецЕсли;
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Текст);
		Возврат ПрочитатьJSON(Чтение);
	Исключение
		Возврат Новый Структура;
	КонецПопытки;

КонецФункции

Функция СвойствоСведений(Сведения, Имя, ПоУмолчанию = Неопределено)

	Значение = Неопределено;
	Если ТипЗнч(Сведения) <> Тип("Структура") Или Не Сведения.Свойство(Имя, Значение) Или Значение = Неопределено Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	Возврат Значение;

КонецФункции

#КонецОбласти
